
'''
1.NoneType = ничего
2.Boolean = true/false
3.Integer = целое число
4.Float = число в плавающей точкой
5.Complex = комплесные числа
6.Списковые типы данных:
    List = массив
    Tuple = кортеж
7.String = строка
8.Set = Множеста, убирает дубликаты
9.frozenset = неизменяемое множество
10.dict = словарь, хранит данные в виде ключ/значение

неизменяемые типы данных:
1.NoneType
2.Boolean
3.int
4.float
5.complex
6.tuple
7.str
8.frozenset

Изменяемые типы данных:
1.list
2.set
3.dict

   ПЕРЕМЕННЫЕ

это ссылка на ячейку в пямати в которой хранится инфа 

как должны называться переменные
 
название переменной должна начинаться с алфавитного символа или с нижнего подчеркивания

название не может начиться с цифры

не может содержать различные символы

нельзя зарезервированные слова 

Python является языком с динамической типизацией

'''

    #   ВВОД И ВЫВОД ДАННЫХ   

# number = int(input("Введите число: ")) #ввод пользователя
# print("Введенное число умноженное на 5: ", number * 5)

# print(type(number)) #функция которые выводит тип данных




        #ОПЕРАЦИИ НАД ЧИСЛАМИ
# "/" - обычное деление
# "//" - целочисленное деление


# print(3443 // 43)

# % остаток от деления

# print(5 % 4)


# ** - возведение в степень

# print(5 ** 3)

# 25 ** 0.5 - квадратный корень числа


# модуль числа - из отрицательного числа в положительное

# print(abs(-2.3))

# pow - возводит в степень и возвращает остаток от деления
# print(pow(2, 3)) = 2 ** 3
# print(pow(2, 3, 4)) = (2 ** 3) % 4

# divmod() функция которая принимает 2 числа и вернет 2 числа
# 1 - результат целочисленного деления
# 2 - остаток от деления
# print(divmod(3, 5))

# round - функция которая округляет число

# from math import pi - импорт данных

# dir - возвращает функции модуля


# множественное присваивание 

# x = 1
# y = 2
# z = 3

# z = x, y
# print(z)


# from math import pi

# r = int(input("Введите значение: "))
# P = pi * (r ** 2)
# O = 2 * pi * r
# print("Периметр окружности: ", round(P, 1))
# print("Площадь окружности: ", round(O, 1))






